package com.props.project;

import asia.redact.bracket.properties.Properties;
import asia.redact.bracket.properties.impl.PropertiesImpl;
import asia.redact.bracket.properties.values.BasicValueModel;
import asia.redact.bracket.properties.values.Comment;

public final class CArabic extends PropertiesImpl {
  public static final long serialVersionUID = 1;

  public CArabic() {
    super(true);
    init();
  }

  public Properties init() {
    super.init();
    final String [] svar0 = {"هذا في الواقعة الإمتعاض, ٣٠ يكن موالية الخطّة واستمرت, ببعض الصين إذ لان. ثم أضف الصين الأسيوي ولكسمبورغ. جُل عل الذود يرتبط والفلبين, بل حتى انتباه وتنصيب ألمانيا. عقبت فبعد وانهاء ومن إذ."};
    map.put("line0", new BasicValueModel(new Comment("#  Arabic properties file, random lorem ipsem contents but should be legal chars "), '=', svar0));
    final String [] svar1 = {"قد كلّ رئيس الذود أعمال, بل دخول حاملات نفس. إذ لغات ومطالبة وانتهاءً حول, نفس عن الجنود وبالرغم. ٣٠ فبعد الأول يبق, ان تلك وشعار المتاخمة الموسوعة. معاملة والنفيس لها أن, كل الإنزال الحيلولة على. ألمّ لهيمنة باستخدام شيء كل, عن بلاده أعمال لهيمنة نفس, دول هو وبداية المواد. كما إذ جيما الأجل واستمر, دارت الحرة للإتحاد تم عرض, عن غينيا البرية تلك."};
    map.put("line1", new BasicValueModel(new Comment(""), '=', svar1));
    final String [] svar2 = {"لفشل بلاده كلا من, حدى مع أخرى الحكم تعديل. بشرية اقتصادية لمّ عل. به، رئيس بزمام أن. لمّ ٣٠ جورج فرنسا, طوكيو كثيرة شيء ٣٠, السفن الإتفاقية لم كلّ."};
    map.put("line2", new BasicValueModel(new Comment(""), '=', svar2));
    final String [] svar3 = {"مسارح العناد الجنوبي بـ كلا, ولم وقامت والمعدات التاريخ، كل. يبق تشكيل الشهير الأعمال هو, إذ احداث نتيجة وصافرات به،. كل شمال لأداء للإتحاد مكن, في فبعد وباءت واقتصار وقد, يكن النفط الشرقي ويكيبيديا أن. مدن حاول لإنعدام والمعدات ٣٠. قبل بـ عُقر قبضتهم."};
    map.put("line3", new BasicValueModel(new Comment(""), '=', svar3));
    final String [] svar4 = {"السبب استمرار انتصارهم ٣٠ بال, ذات للإتحاد الأثناء، هو, سقطت اعلان ما لكل. الثالث الإقتصادية ان لمّ. عملية وكسبت انه أم, خيار بداية الفترة وقد أن, يتم أثره، العناد الأسيوي من. ما كلا نهاية بريطانيا،. غير أمّا الجو ثم, كانتا الدّفاع مدن بـ."};
    map.put("line4", new BasicValueModel(new Comment(""), '=', svar4));
    final String [] svar5 = {"الآخر العمليات كما عن. يبق الخاسر الأبرياء قد, وفي بحشد شمال الإقتصادية قد. زهاء وبغطاء بالتوقيع وصل و, جمعت الحكم الأوضاع يبق عن. تم أسيا بقيادة كما. كلا الخطّة العاصمة الأبرياء في. جُل ما جمعت الأرض الثالث."};
    map.put("line5", new BasicValueModel(new Comment(""), '=', svar5));
    final String [] svar6 = {"دفّة بقسوة الإنذار، حدى ما. عل معارضة الأولية وباستثناء وقد, مكّن أوسع أدوات أم ضرب, دول إذ الصفحة الأهداف. بقيادة الصعداء قد إيو, عرض أم التي مشارف معزّزة. معارضة المجتمع قبل ان, وبعض تسبب اتفاق يبق بل. دار بلاده بينما وايرلندا مع. أي ذات وسفن تكتيكاً واستمرت, مع حكومة فهرست ولكسمبورغ بعض."};
    map.put("line6", new BasicValueModel(new Comment(""), '=', svar6));
    final String [] svar7 = {"هو الشرقي واشتدّت أخذ. و حين الحكومة شموليةً, الضروري ارتكبها بريطانيا-فرنسا كلا أن. عليها استبدال والنفيس وقد لم. بـ وتنامت التاريخ، التنازلي الى, تعد مع أثره، المتحدة والفرنسي, ثمّة تعداد إذ أضف. بها مئات تمهيد والكساد عن, يكن ٠٨٠٤ انتصارهم عل, ديسمبر العالم، العالمية عل انه. أضف تعديل الصين المتساقطة، في, الإمداد بالمطالبة بل ذلك."};
    map.put("line7", new BasicValueModel(new Comment(""), '=', svar7));
    final String [] svar8 = {"لعملة أوروبا لكل و. في بحق السيطرة ومطالبة, انه مع الأولى بتحدّي ابتدعها, تعد أواخر العدّ تكتيكاً أي. فصل لم أسيا ليركز واندونيسيا،, سقطت أحكم الخطّة إذ بين. تحت بل حلّت صفحة سياسة, في هامش ومضى أضف. أم فعل ومطالبة وايرلندا, بعد عل كانت الأرض, أسر شدّت فاتّبع الأثنان في."};
    map.put("line8", new BasicValueModel(new Comment(""), '=', svar8));
    final String [] svar9 = {"وفي ٠٨٠٤ تطوير ولاتّساع كل, ٣٠ لمّ أوسع واتّجه الخاسر, بـ بعض جيوب الضغوط والديون. كلا الأثنان والإتحاد لم, مسرح أطراف الخاسر من إيو. حقول ثمّة انه أي, بلا حاملات انتصارهم و, عل قام ٢٠٠٤ ليركز يونيو. غير دخول علاقة الأثناء، كل, بـ وبدأت العاصمة واقتصار يتم. يكن تم ليرتفع الإنزال, ثم بين وعلى اليابان،, كل كلّ هاربر الأوروبي."};
    map.put("line9", new BasicValueModel(new Comment(""), '=', svar9));
    return this;
  }
}
